Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "Authentication" [RFC7235]
zh_cn: “认证”[RFC7235]

source: "Caching" [RFC7234]
zh_cn: “缓存”[RFC7234]

source: "Conditional Requests" [RFC7232]
zh_cn: “有条件请求”[RFC7232]

source: "Message Syntax and Routing" (this document)
zh_cn: “消息语法和路由”(本文档)

source: "Quality values" is a misnomer, since these values merely represent relative degradation in desired quality.
zh_cn: “质量值”是一个用词不当的词，因为这些值仅代表所需质量的相对下降。

source: "Range Requests" [RFC7233]
zh_cn: “范围请求”[RFC7233]

source: "Semantics and Content" [RFC7231]
zh_cn: “语义和内容”[RFC7231]

source: "multipart/byteranges" is no longer a way of determining message body length detection.
zh_cn: “multipart/byteranges”不再是确定消息体长度检测的方法。

source: # Base reactive interfaces
zh_cn: # 基本响应接口

source: # Contents
zh_cn: # 内容

source: # Creating backpressured datasources
zh_cn: # 创建背压数据源

source: # Entering the reactive world
zh_cn: # 进入响应世界

source: # Introduction
zh_cn: # 介绍

source: # Leaving the reactive world
zh_cn: # 离开响应世界

source: # Maven address and base package
zh_cn: # Maven 地址和基础包

source: # Miscellaneous changes
zh_cn: # 杂项更改

source: # Observable and Flowable
zh_cn: # Observable 和 Flowable

source: # Operator differences
zh_cn: # 操作符差异

source: # Other classes
zh_cn: # 其他类

source: # RxJava: Reactive Extensions for the JVM
zh_cn: # RxJava: Reactive Extensions for the JVM 原文 [ReactiveX/RxJava](https://github.com/ReactiveX/RxJava)

source: # The onBackpressureXXX operators
zh_cn: # onBackpressureXXX 操作符

source: ## 1.x Observable to 2.x Flowable
zh_cn: ## 1.x Observable 到 2.x Flowable

source: ## Batching/skipping values with standard operators
zh_cn: ## 使用标准操作符批处理/跳过值

source: ## Binaries
zh_cn: ## 二进制文件

source: ## Bugs and Feedback
zh_cn: ## 错误和反馈

source: ## Build
zh_cn: ## 构建

source: ## Communication
zh_cn: ## 沟通

source: ## Full Documentation
zh_cn: ## 完整文档

source: ## Getting started
zh_cn: ## 入门

source: ## Increasing the buffer sizes
zh_cn: ## 增加缓冲区大小

source: ## Testing an async source
zh_cn: ## 测试异步源

source: ## Versioning
zh_cn: ## 版本

source: ## Which type to use?
zh_cn: ## 使用哪种类型？

source: ## cancel and request upfront
zh_cn: ## 取消并提前请求

source: ### Base classes
zh_cn: ### 基类

source: ### Calling request from onSubscribe/onStart
zh_cn: ### 从 onSubscribe/onStart 调用请求

source: ### Concurrency within a flow
zh_cn: ### Concurrency within a flow (流中的并发)

source: ### Different return types
zh_cn: ### 不同的返回类型

source: ### Factory methods:
zh_cn: ### 工厂方法：

source: ### Further reading
zh_cn: ### 扩展阅读

source: ### Instance methods:
zh_cn: ### 实例方法：

source: ### Notable new assert methods
zh_cn: ### 值得注意的新断言方法

source: ### Operator naming conventions
zh_cn: ### 运算符命名约定

source: ### Parallel processing
zh_cn: ### Parallel processing (并行处理)

source: ### Removals
zh_cn: ### 移除

source: ### RxJava Libraries
zh_cn: ### RxJava 库

source: ### RxJava is Lightweight
zh_cn: ### RxJava 是轻量级的

source: ### RxJava is a Polyglot Implementation
zh_cn: ### RxJava 是一个多语言实现

source: ### Schedulers
zh_cn: ### Schedulers (调度器)

source: ### Setting up the dependency
zh_cn: ### 设置依赖

source: ### Simple background computation
zh_cn: ### 简单的后台计算

source: ### Some terminology
zh_cn: ### 一些术语

source: ### Type conversions
zh_cn: ### Type conversions (类型转换)

source: ### When to use Flowable
zh_cn: ### 何时使用 Flowable

source: ### When to use Observable
zh_cn: ### 何时使用 Observable

source: #### Assembly time
zh_cn: #### Assembly time (编译时)

source: #### Backpressure
zh_cn: #### Backpressure (背压)

source: #### Converting to the desired type
zh_cn: #### 转换为所需类型

source: #### Error handling
zh_cn: #### 错误处理

source: #### Objects in motion
zh_cn: #### Objects in motion (运动中的对象)

source: #### Runtime
zh_cn: #### Runtime (运行时)

source: #### Subscription time
zh_cn: #### Subscription time (订阅时)

source: #### Type ambiguities
zh_cn: #### 类型歧义

source: #### Type erasure
zh_cn: #### 类型擦除

source: #### Unusable keywords
zh_cn: #### 不可用的关键字

source: #### Upstream, downstream
zh_cn: #### Upstream, downstream (上游，下游)

source: #### Using an overload with the desired type
zh_cn: #### 使用所需类型的重载

source: () Indicates messages protected using keys derived from a client_early_traffic_secret.
zh_cn: () 表示使用从 client_early_traffic_secret 派生的密钥保护的消息。

source: (A sequence is idempotent if a single execution of the entire sequence always yields a result that is not changed by a reexecution of all, or part, of that sequence.) For example, a sequence is non-idempotent if its result depends on a value that is later modified in the same sequence.
zh_cn: (如果整个序列的单次执行总是产生一个不会通过重新执行该序列的全部或部分而改变的结果，则序列是幂等的。)例如，如果一个序列的结果依赖于一个稍后在同一序列中修改的值，则该序列是非幂等的

source: (But see section 19.6.1.1 for other requirements on Host support in HTTP/1.1.)
zh_cn: (但有关 HTTP/1.1 中 Host 支持的其他要求，请参阅第 19.6.1.1 节。)

source: (Closing the connection cannot be used to indicate the end of a request body, since that would leave no possibility for the server to send back a response.)
zh_cn: (关闭连接不能用于指示请求正文的结束，因为这样就不会让服务器发回响应。)

source: (For example, old protocol versions might be avoided for security reasons.) This message is always fatal.
zh_cn: (例如，出于安全原因，可能会避免使用旧协议版本。)此消息始终是致命的。

source: (For instance, a client may be connecting to a machine whose address and hostname are dynamic but the client knows the certificate that the server will present.) In such cases, it is important to narrow the scope of acceptable certificates as much as possible in order to prevent man in the middle attacks.
zh_cn: (例如，客户端可能正在连接到一台机器，其地址和主机名是动态的，但客户端知道服务器将提供的证书。)在这种情况下，尽可能缩小可接受证书的范围非常重要，为了防止中间人攻击。

source: (However, section 3.6 places restrictions on when certain transfer-codings may be used.)
zh_cn: (但是，第 3.6 节限制了何时可以使用某些转输编码。)

source: (If the source Observable does not emit any values, the AsyncSubject also completes without emitting any values.)
zh_cn: (如果源 Observable 未发射任何值，则 AsyncSubject 也会完成而不会发射任何值。)

source: (Note that the content of the handshake as a whole, including the SessionID, is protected by the Finished messages exchanged at the end of the handshake.)
zh_cn: （请注意，握手的内容（包括 SessionID）受握手结束时交换的 Finished 消息的保护。）

source: (PSK-based authentication happens as a side effect of key exchange.) Specifically:
zh_cn: (基于 PSK 的身份验证是密钥交换的副作用。)具体来说：

source: (See Appendix A.1.) Note that a client that supports multiple versions of TLS may not know what version will be employed before it receives the ServerHello.
zh_cn: (请参阅附录 A.1。)请注意，支持多个 TLS 版本的客户端在收到 ServerHello 之前可能无法知道将使用的版本。

source: (See Appendix A.2.3 of [Kri2001] for details.)
zh_cn: (详见 [Kri2001] 附录 A.2.3。)

source: (See Appendix A.6 for formal definition.)
zh_cn: (正式定义见附录 A.6。)

source: (See Appendix D for details about backward compatibility.)
zh_cn: (有关向后兼容性的详细信息，请参阅附录 D.)

source: (See Appendix E for details about backward compatibility.)
zh_cn: (有关向后兼容性的详细信息，请参阅附录 E.)

source: (See Section 6.1.)
zh_cn: (见 6.1 节)

source: (See flow chart below.) Application data MUST NOT be sent prior to the completion of the first handshake (before a cipher suite other than TLS_NULL_WITH_NULL_NULL is established).
zh_cn: (参见下面的流程图。)在第一次握手完成之前(在建立 TLS_NULL_WITH_NULL_NULL 之外的加密套件之前)不得发送应用程序数据。

source: (See flow chart below.) If a Session ID match is not found, the server generates a new session ID, and the TLS client and server perform a full handshake.
zh_cn: (请参阅下面的流程图。)如果未找到会话 ID 匹配，则服务器会生成新的会话 ID，并且 TLS 客户端和服务器会执行完全握手。

source: (The PSK binders also perform key confirmation, in a similar fashion.) These three messages are always sent as the last messages in their handshake flight.
zh_cn: (PSK binder 也以类似的方式执行密钥确认。)这三条消息总是作为握手航班中的最后一条消息发送。

source: (The Reactive-Streams specification allows throwing `NullPointerException` if the `onSubscribe`, `onNext` or `onError` receives a `null` value, but RxJava doesn't let `null`s in any way.) This means the following code is no longer legal:
zh_cn: （如果 `onSubscribe`，`onNext` 或 `onError` 接收到 `null` 值，Reactive-Streams 规范允许抛出 `NullPointerException`，但 RxJava 不以任何方式接受 `null`。这意味着以下代码不再合法：

source: (The last three tags above are not registered tags; all but the last are examples of tags which could be registered in future.)
zh_cn: (上面的最后三个标签不是注册标签；除了最后一个标签之外的所有标签都是可以在将来注册的标签示例。)

source: (The reason for this is twofold: performance and ease of use of the library as a synchronous Java 8 Streams-like processor.)
zh_cn: (原因有两个：作为同步 Java 8 Streams 类似处理器的库的性能和易用性。)

source: (The same approach works with `GroupedFlowable` as well.)
zh_cn: (同样的方法也适用于 `GroupedFlowable`。)

source: (This is understandable because
zh_cn: (这是可以理解的，因为

source: (This rule differs slightly from the path-abempty rule of RFC 3986, which allows for an empty path to be used in references, and path-absolute rule, which does not allow paths that begin with "//".) A "partial-URI" rule is defined for protocol elements that can contain a relative URI but not a fragment component.
zh_cn: (此规则略微不同于 RFC 3986 的路径优先规则，它允许在引用中使用空路径，而 path-absolute 规则则不允许以“//”开头的路径。)“partial-URI”规则是为可以包含相对 URI 但不包含片段组件的协议元素定义的。

source: (We never had a use for it in 1.x and the original `Subject<T, R>` came from .NET where there is a `Subject<T>` overload because .NET allows the same class name with a different number of type arguments.)
zh_cn: (我们从来没有在 1.x 中使用它，原来的 `Subject<T, R>` 来自 .NET，其中有一个 `Subject<T>` 重载，因为 .NET 允许相同的类名具有不同数量的类型参数。)

source: (b) Determining that all sequence numbers occupied by a segment have been acknowledged (e.g., to remove the segment from a retransmission queue).
zh_cn: (b) 确定已经确认了报文段所占用的所有序列号(例如，从重发队列中删除该报文段)。

source: (c) Determining that an incoming segment contains sequence numbers which are expected (i.e., that the segment "overlaps" the receive window).
zh_cn: (c) 确定传入报文段包含预期的序列号(即，报文段“重叠”接收窗口)。

source: (except when messages were corrupted in the network).
zh_cn: (除非网络中的消息已损坏)。

source: (this includes all key exchange methods defined in this document except DH_anon).
zh_cn: (这包括本文档中定义的除 DH_anon 之外的所有密钥交换方法)。

source: (those provisioned as the resumption master secret of a previous handshake).
zh_cn: (那些被规定为前一次握手的恢复主密钥)。

source: * Indicates optional or situation-dependent messages/extensions that are not always sent.
zh_cn: * 表示并非总是发送的可选或依赖于情境的消息/扩展。

source: * Indicates optional or situation-dependent messages that are not always sent.
zh_cn: * 表示不总是发送的可选或与情况相关的消息。

source: *(Remark: this is "experimental" in RC2 and RC3 to see how it feels to program with such mixed-type sequences and whether or not there has to be too much `toObservable`/`toFlowable` back-conversion.)*
zh_cn: *(注：这在 RC2 和 RC3 中是“实验性的”，看看用这种混合型序列编程感觉如何，以及是否必须有太多 `toObservable`/`toFlowable` 反向转换。)*

source: *(You could also consider IxJava which is optimized for Iterable flows supporting Java 6+)*.
zh_cn: *(您还可以考虑 IxJava，它针对支持 Java 6+ 的 Iterable 流程进行了优化)*.

source: **Backpressure** is when in an `Flowable` processing pipeline, some asynchronous stages can't process the values fast enough and need a way to tell the upstream producer to slow down.
zh_cn: **Backpressure (背压)** 是在 `Flowable` 外理管道中，某些异步阶段无法足够快地处理这些值，需要一种方法来告诉上游生产者减速。

source: **RC3** dropped, use `ignoreElements`
zh_cn: **RC3** 删除，请使用 `ignoreElements`

source: **RC3** dropped, use `single(T)`
zh_cn: **RC3** 已删除，请使用 `single(T)``

source: **RC3** no longer signals NoSuchElementException if the source is shorter than the index
zh_cn: 如果源短于索引，**RC3** 不再发出 NoSuchElementException 信号

source: **RC3** renamed to `firstElement` and returns `Maybe<T>`
zh_cn: **RC3** 重命名为 `firstElement` 并返回 `Maybe<T>`

source: **RC3** renamed to `lastElement` and returns `Maybe<T>`
zh_cn: **RC3** 重命名为 `lastElement` 并返回 `Maybe<T>`

source: **RC3** renamed to `singleElement` and returns `Maybe<T>`
zh_cn: **RC3** 重命名为 `singleElement` 并返回 `Maybe<T>`

source: **RC3** returns `Completable`
zh_cn: **RC3** 返回 `Completable`

source: **RC3** returns `Maybe<T>`
zh_cn: **RC3** 返回 `Maybe<T>`

source: **RC3** returns `Single<Boolean>`
zh_cn: **RC3** 返回 `Single<Boolean>`

source: **RC3** returns `Single<Boolean>` now
zh_cn: **RC3** 现在返回 `Single<Boolean>`

source: **RC3** returns `Single<List<T>>`
zh_cn: **RC3** 返回 `Single<List<T>>`

source: **RC3** returns `Single<Long>` now
zh_cn: **RC3** 现直返回 `Single<Long>`

source: **RC3** returns `Single<Map<K, Collection<V>>>`
zh_cn: **RC3** 返回 `Single<Map<K, Collection<V>>>`

source: **RC3** returns `Single<Map<K, V>>`
zh_cn: **RC3** 返回 `Single<Map<K, V>>`

source: **RC3** returns `Single<U>`
zh_cn: **RC3** 返回 `Single<U>`

source: **The `Flowable`-based sources and operators are, as of 2.0.7, fully Reactive-Streams version 1.0.0 specification compliant.**
zh_cn: **从 2.0.7 开始，基于 `Flowable` 的源和运算符完全符合 Reactive-Streams 版本 1.0.0 规范。**

source: + Indicates noteworthy extensions sent in the previously noted message.
zh_cn: + 表示在先前提到的消息中发送的值得注意的扩展。

source: - "0" indicates a string of Hash.length bytes set to zero.
zh_cn: - “0”表示将 Hash.length 字节的字符串设置为零。

source: - "extension_data" contains information specific to the particular extension type.
zh_cn: - “extension_data”包含特定扩展类型的特定信息。

source: - "extension_type" identifies the particular extension type.
zh_cn: - “extension_type”标识特定的扩展类型。

source: - (EC)DHE (Diffie-Hellman over either finite fields or elliptic curves)
zh_cn: - (EC)DHE (Diffie-Hellman 在有限域或椭圆曲线上)

source: - (EC)DHE shared secret (Section 7.4)
zh_cn: - (EC)DHE 共享密钥(第 7.4 节)

source: - A "pre_shared_key" (Section 4.2.11) extension which contains a list of symmetric key identities known to the client and a "psk_key_exchange_modes" (Section 4.2.9) extension which indicates the key exchange modes that may be used with PSKs.
zh_cn: - “pre_shared_key”(第 4.2.11 节)扩展，其中包含客户端已知的对称密钥标识列表和“psk_key_exchange_modes”(第 4.2.9 节)扩展，该扩展指示可与 PSK 一起使用的密钥交换模式。

source: - A "signature_algorithms" (Section 4.2.3) extension which indicates the signature algorithms which the client can accept.
zh_cn: - “signature_algorithms”(第 4.2.3 节)扩展，指示客户端可以接受的签名算法。

source: - A "supported_groups" (Section 4.2.7) extension which indicates the (EC)DHE groups which the client supports and a "key_share" (Section 4.2.8) extension which contains (EC)DHE shares for some or all of these groups.
zh_cn: - “supported_groups”(第 4.2.7 节)扩展，指示客户端支持的 (EC)DHE 组和“key_share”(第 4.2.8 节)扩展，其中包含部分或全部这些组的(EC)DHE 共享。

source: - A Base Key to be used to compute a MAC key.
zh_cn: - 用于计算 MAC 密钥的基本密钥。

source: - A Handshake Context consisting of the set of messages to be included in the transcript hash.
zh_cn: - 握手上下文，包含要包含在转录哈希中的消息集。

source: - A handshake protocol (Section 4) that authenticates the communicating parties, negotiates cryptographic modes and parameters, and establishes shared keying material.
zh_cn: - 握手协议(第 4 节)，用于验证通信方，协商加密模式和参数，以及建立共享密钥材料。

source: - A list of cipher suites which indicates the AEAD algorithm/HKDF hash pairs which the client supports.
zh_cn: - 密码套件列表，表示客户端支持的 AEAD 算法/HKDF 哈希对。

source: - A purpose value indicating the specific value being generated
zh_cn: - 表示正在生成的特定值的目的值

source: - A record protocol (Section 5) that uses the parameters established by the handshake protocol to protect traffic between the communicating peers.
zh_cn: - 记录协议(第 5 节)，它使用握手协议建立的参数来保护通信对等体之间的通信。

source: - A secret value
zh_cn: - 一个密钥值

source: - A single 0 byte which serves as the separator
zh_cn: - 单个 0 字节，用作分隔符

source: - A string that consists of octet 32 (0x20) repeated 64 times
zh_cn: - 由八位字节 32(0x20)组成的字符串，重复 64 次

source: - A version downgrade protection mechanism is described in Section 4.1.3.
zh_cn: - 版本降级保护机制在 4.1.3 节中描述。

source: - A zero round-trip time (0-RTT) mode was added, saving a round trip at connection setup for some application data, at the cost of certain security properties.
zh_cn: - 增加了零往返时间(0-RTT)模式，在某些应用数据的连接设置中节省了往返，但代价是某些安全属性。

source: - Added HMAC-SHA256 cipher suites.
zh_cn: - 增加了 HMAC-SHA256 密码套件。

source: - Added an Implementation Pitfalls sections
zh_cn: - 增加了实现陷阱部分

source: - Added limited "fall-through" to the presentation language to allow multiple case arms to have the same encoding.
zh_cn: - 为演示语言添加了有限的“直通”，以允许多个案例组具有相同的编码。

source: - Addition of support for authenticated encryption with additional data modes.
zh_cn: - 通过其他数据模式添加对经过身份验证的加密的支持。

source: - After a certificate_request, if no certificates are available, clients now MUST send an empty certificate list.
zh_cn: - 在 certificate_request 之后，如果没有可用的证书，客户端现在必须发送一个空的证书列表。

source: - Alerts MUST now be sent in many cases.
zh_cn: - 现在必须在许多情况下发送警报。

source: - All handshake messages after the ServerHello are now encrypted.
zh_cn: - ServerHello 之后的所有握手消息现在都已加密。

source: - Allow the client and server to verify that their peer has calculated the same security parameters and that the handshake occurred without tampering by an attacker.
zh_cn: - 允许客户端和服务器验证其对等端是否计算了相同的安全性参数，并且发生了握手而不会被攻击者篡改。

source: - Allowing the server to force the client to demonstrate reachability at their apparent network address (thus providing a measure of DoS protection).
zh_cn: - 允许服务器强制客户端在其明显的网络地址上演示可达性(从而提供 DoS 保护措施)。

source: - Allowing the server to offload state to the client, thus allowing it to send a HelloRetryRequest without storing any state.
zh_cn: - 允许服务器将状态卸载到客户端，从而允许它发送 HelloRetryRequest 而不存储任何状态。

source: - Any certificates provided by the client MUST be signed using a hash/signature algorithm pair found in supported_signature_algorithms.
zh_cn: - 客户端提供的任何证书必须使用 supported_signature_algorithms 中的散列/签名算法对进行签名。

source: - Authentication: Authenticate the server (and, optionally, the client) and provide key confirmation and handshake integrity.
zh_cn: - 身份验证：验证服务器(以及可选的验证客户端)并提供密钥确认和握手完整性。

source: - Authentication: The server side of the channel is always authenticated; the client side is optionally authenticated.
zh_cn: - 身份验证：通道的服务器端始终进行身份验证；客户端可选地进行身份验证。

source: - Cleaned up description of Bleichenbacher/Klima attack defenses.
zh_cn: - 清理 Bleichenbacher/Klima 攻击防御的描述。

source: - Confidentiality: Data sent over the channel after establishment is only visible to the endpoints.
zh_cn: - 保密性：建立后通过信道发送的数据仅对端点可见。

source: - Derive-Secret's Secret argument is indicated by the incoming arrow.
zh_cn: - Derive-Secret 的机秘参数由传入的箭头指示。

source: - ECDSA signature schemes align with TLS 1.2's ECDSA hash/signature pairs.
zh_cn: - ECDSA 签名方案与 TLS 1.2 的 ECDSA 哈希/签名对一致。

source: - Elliptic curve algorithms are now in the base spec, and new signature algorithms, such as EdDSA, are included.
zh_cn: - 椭圆曲线算法现在在基本规范中，并且包括新的签名算法，例如 EdDSA。

source: - Exchange certificates and cryptographic information to allow the client and server to authenticate themselves.
zh_cn: - 交换证书和加密信息，以允许客户端和服务器自我验证。

source: - Exchange hello messages to agree on algorithms, exchange random values, and check for session resumption.
zh_cn: - 交换 hello 消息以同意算法，交换随机值，并检查会话恢复。

source: - Exchange the necessary cryptographic parameters to allow the client and server to agree on a premaster secret.
zh_cn: - 交换必要的加密参数，以允许客户端和服务器就预主密钥 (premaster) 达成一致。

source: - Extensions should, as far as possible, be designed to prevent any attack that forces use (or non-use) of a particular feature by manipulation of handshake messages.
zh_cn: - 扩展应尽可能设计为防止任何通过操纵握手消息强制使用(或不使用)特定功能的攻击。

source: - For historical reasons, the names of some client certificate types include the algorithm used to sign the certificate.
zh_cn: - 由于历史原因，某些客户端证书类型的名称包括用于签署证书的算法。

source: - Generate a master secret from the premaster secret and exchanged random values.
zh_cn: - 从预主密钥生成主密钥并交换随机值。

source: - HKDF-Extract is drawn as taking the Salt argument from the top and the IKM argument from the left, with its output to the bottom and the name of the output on the right.
zh_cn: - HKDF-Extract 绘制为从顶部获取 Salt 参数，从左侧获取 IKM 参数，其输出显示在底部，输出名称在右侧。

source: - Handshake messages MUST NOT be interleaved with other record types.
zh_cn: - 握手消息不得与其他记录类型交错。

source: - Handshake messages MUST NOT span key changes.
zh_cn: - 握手消息绝不能跨越密钥更改。

source: - If PSK is being used, then the server will send a "pre_shared_key" extension indicating the selected key.
zh_cn: - 如果正在使用 PSK，则服务器将发送指示所选密钥的“pre_shared_key”扩展。

source: - If a "key_share" extension was supplied in the HelloRetryRequest, replacing the list of shares with a list containing a single KeyShareEntry from the indicated group.
zh_cn: - 如果在 HelloRetryRequest 中提供了“key_share”扩展，则使用包含指定组中的单个 KeyShareEntry 的列表替换共享列表。

source: - If the "certificate_authorities" extension in the CertificateRequest message was present, at least one of the certificates in the certificate chain SHOULD be issued by one of the listed CAs.
zh_cn: - 如果 CertificateRequest 消息中存在“certificate_authorities”扩展，则证书链中的至少一个证书应该由列出的 CA 之一颁发。

source: - If the CertificateRequest message contained a non-empty "oid_filters" extension, the end-entity certificate MUST match the extension OIDs that are recognized by the client, as described in Section 4.2.5.
zh_cn: - 如果 CertificateRequest 消息包含非空的“oid_filters”扩展，则终端实体证书必须与客户端识别的扩展 OID 匹配，如第 4.2.5 节中所述。

source: - If the certificate_authorities list in the certificate request message was non-empty, one of the certificates in the certificate chain SHOULD be issued by one of the listed CAs.
zh_cn: - 如果证书请求消息中的 certificate_authorities 列表非空，则证书链中的一个证书应该由列出的 CA 之一颁发。

source: - If the negotiated key exchange algorithm is one of (DHE_DSS, DH_DSS), behave as if the client had sent the value {sha1,dsa}.
zh_cn: - 如果协商密钥交换算法是(DHE_DSS，DH_DSS)之一，则表现为客户端已发送值 {sha1,dsa}。

source: - If the negotiated key exchange algorithm is one of (ECDH_ECDSA, ECDHE_ECDSA), behave as if the client had sent value {sha1,ecdsa}.
zh_cn: - 如果协商密钥交换算法是(ECDH_ECDSA，ECDHE_ECDSA)之一，则表现为客户端已发送值 {sha1,ecdsa}。

source: - If the negotiated key exchange algorithm is one of (RSA, DHE_RSA, DH_RSA, RSA_PSK, ECDH_RSA, ECDHE_RSA), behave as if client had sent the value {sha1,rsa}.
zh_cn: - 如果协商密钥交换算法是(RSA，DHE_RSA，DH_RSA，RSA_PSK，ECDH_RSA，ECDHE_RSA)之一，则表现为客户端已发送值 {sha1,rsa}。

source: - Ignore the extension and return a regular 1-RTT response.
zh_cn: - 忽略扩展并返回常规的 1-RTT 响应。

source: - Implementations that advertise support for RSASSA-PSS (which is mandatory in TLS 1.3) MUST be prepared to accept a signature using that scheme even when TLS 1.2 is negotiated.
zh_cn: - 宣传支持 RSASSA-PSS(在 TLS 1.3 中是强制性的)的实现必须准备好接受使用该方案的签名，即使在协商 TLS 1.2 时也是如此。

source: - In TLS 1.2, the extension contained hash/signature pairs.
zh_cn: - 在 TLS 1.2 中，扩展包含散列/签名对。

source: - Including a "cookie" extension if one was provided in the HelloRetryRequest.
zh_cn: - 如果在 HelloRetryRequest 中提供了一个“cookie”扩展，则包括“cookie”扩展。

source: - Integrity: Data sent over the channel after establishment cannot be modified by attackers without detection.
zh_cn: - 完整性：攻击者无法修改建立后通过信道发送的数据 without detection。

source: - It would be technically possible to use extensions to change major aspects of the design of TLS; for example the design of cipher suite negotiation.
zh_cn: - 在技术上可以使用扩展来改变 TLS 设计的主要方面；例如加密套件协商的设计。

source: - Key Exchange: Establish shared keying material and select the cryptographic parameters.
zh_cn: - 密钥交换：建立共享密钥材料并选择加密参数。

source: - Optionally adding, removing, or changing the length of the "padding" extension [RFC7685].
zh_cn: - 可选地添加，删除或更改“padding”扩展 [RFC7685] 的长度。

source: - Other cryptographic improvements were made, including changing the RSA padding to use the RSA Probabilistic Signature Scheme (RSASSA-PSS), and the removal of compression, the Digital Signature Algorithm (DSA), and custom Ephemeral Diffie-Hellman (DHE) groups.
zh_cn: - 进行了其他加密改进，包括更改 RSA 填充以使用 RSA 概率签名方案(RSASSA-PSS)，以及删除压缩，数字签名算法(DSA)和自定义短暂 Diffie-Hellman(DHE)组。

source: - Other modifications that may be allowed by an extension defined in the future and present in the HelloRetryRequest.
zh_cn: - 未来定义并存在于 HelloRetryRequest 中的扩展可能允许的其他修改。

source: - PSK (a pre-shared key established externally or derived from the resumption_master_secret value from a previous connection)
zh_cn: - PSK(外部建立的预共享密钥或从先前连接的 resumption_master_secret 值派生的)

source: - PSK with (EC)DHE
zh_cn: - PSK 与 (EC)DHE

source: - PSK-only
zh_cn: - 仅 PSK
